app/Http/Controllers/ArtikelController.php

    public function sKomentar($slug)
    {
        $artikel = Artikel::firstWhere('slug', $slug);
---
SELECT * FROM `artikels` LIMIT 18 offset 0

    public function byKategori()
    {
        $sort = '';
        $kategori = request('kategori');
        if (request('sort')) {
            $sort = request()->get('sort');
        }

        return view('daftar-artikel', [
            "articles" => Artikel::byKategori($kategori)->filter(request(['sort', 'search']))->paginate(18),
            "jumlah" => Artikel::count(),
            "active" => $kategori,
            "sort" => $sort,
            "articles_acak" => Artikel::inRandomOrder()->limit(4)->get(),
            "articles_acak2" => Artikel::inRandomOrder()->limit(4)->get(),
            "articles_terbaru" => Artikel::orderBy('tanggal_publikasi', 'desc')->limit(4)->get(),
            "articles_terpopuler" => Artikel::orderBy('pengunjung', 'desc')->limit(4)->get(),
        ]);
---
SELECT count(*) as aggregate FROM `artikels`
SELECT * FROM `artikels` ORDER BY `tanggal_publikasi` DESC LIMIT 4
SELECT * FROM `artikels` ORDER BY RAND() LIMIT 4
SELECT * FROM `artikels` ORDER BY `pengunjung` DESC LIMIT 4